In [61]:
import pandas as pd
import numpy as np

In [27]:
a = pd.Series(data=[1,2,3,4,5,'x'], index=['a','b','c','d','e','f'])

In [28]:
print(a)

a    1
b    2
c    3
d    4
e    5
f    x
dtype: object

In [29]:
print(a.index)

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [30]:
print(a.values)

[1 2 3 4 5 'x']

In [31]:
print(a['a'])

1

In [32]:
print(a[0])

1

In [33]:
print(a['f'])

x

In [34]:
b = pd.Series(data=[1,2,3,4,5,'x'])

In [35]:
b.index

RangeIndex(start=0, stop=6, step=1)

In [36]:
b[1]

2

In [37]:
x = {'a' : 10, 'b': 20, 1: 30}

In [38]:
x.__class__

dict

In [39]:
d = pd.Series({'a' : 10, 'b': 20, 'c': 30})

In [40]:
d

a    10
b    20
c    30
dtype: int64

In [41]:
x = {'a': 10, 'b': 20, 1: 'a'}

In [42]:
pd.Series(x)

a    10
b    20
1     a
dtype: object

In [43]:
pd.Series(x, index=[1, 'b', 'c'])

1      a
b     20
c    NaN
dtype: object

In [44]:
s1 = pd.Series(data=[1,2,3,4], index=['a', 'b', 'c', 'd'])
s2 = pd.Series(data=[30, 31, 30, 29], index=['a', 'b', 'c', 'd'])
s3 = pd.Series(data=[100, 102, 103], index=['a', 'c', 'd'])

In [45]:
pd.DataFrame({'col-1': s1, 'col-2': s2})

   col-1  col-2
a      1     30
b      2     31
c      3     30
d      4     29

In [46]:
df2 = pd.DataFrame({'col-1': s1, 'col-2': s3})

In [47]:
df2

   col-1  col-2
a      1  100.0
b      2    NaN
c      3  102.0
d      4  103.0

In [48]:
df2['col-1']

a    1
b    2
c    3
d    4
Name: col-1, dtype: int64

In [49]:
df2.loc['a']

col-1      1.0
col-2    100.0
Name: a, dtype: float64

In [50]:
df2.loc['a']['col-1']

1.0

In [56]:
d = {'a': [1,2,3,4], 'b':[100,0,0,10]}

In [57]:
pd.DataFrame(d)

   a    b
0  1  100
1  2    0
2  3    0
3  4   10

In [53]:
pd.DataFrame(d, index=['a','b','c','d'])

   a    b
a  1  100
b  2    0
c  3    0
d  4   10

In [67]:
d=np.array([[1,2,3,4], [10,20,30,40]])

In [70]:
pd.DataFrame(d, index=['a', 'b'])

    0   1   2   3
a   1   2   3   4
b  10  20  30  40

In [76]:
d=[{'a':1, 'b':2, 'c':3}, {'a':10, 'b':100}]
pd.DataFrame(d)

    a    b    c
0   1    2  3.0
1  10  100  NaN

In [84]:
s1 = pd.Series(data=[1,2,3,4], index=['a','b','c','d'])
s2 = pd.Series(data=[10,20,30,40], index=['a','b','d','e'])

s1

In [85]:
s1+s2

a    11.0
b    22.0
c     NaN
d    34.0
e     NaN
dtype: float64

In [86]:
s1*s2

a     10.0
b     40.0
c      NaN
d    120.0
e      NaN
dtype: float64

In [88]:
s1[0]

1

In [89]:
s1['a']

1

In [91]:
s1[0:2]

a    1
b    2
dtype: int64

In [100]:
df = pd.DataFrame({'col-1': s1, 'col-2':s2})

In [101]:
df

   col-1  col-2
a    1.0   10.0
b    2.0   20.0
c    3.0    NaN
d    4.0   30.0
e    NaN   40.0

In [103]:
df['col-1']

a    1.0
b    2.0
c    3.0
d    4.0
e    NaN
Name: col-1, dtype: float64

In [104]:
df.loc['a']

col-1     1.0
col-2    10.0
Name: a, dtype: float64

In [108]:
df.loc['b']

col-1     2.0
col-2    20.0
Name: b, dtype: float64

In [109]:
df.loc[['a', 'b']]

   col-1  col-2
a    1.0   10.0
b    2.0   20.0

In [116]:
s3 = pd.Series(data=[10,15,24,10], index=['a','b','c', 'e'])

In [117]:
df['col-3'] = s3

In [118]:
df

   col-1  col-2  col-3
a    1.0   10.0   10.0
b    2.0   20.0   15.0
c    3.0    NaN   24.0
d    4.0   30.0    NaN
e    NaN   40.0   10.0

In [121]:
df.pop('col-2')

a    10.0
b    20.0
c     NaN
d    30.0
e    40.0
Name: col-2, dtype: float64

In [122]:
df

   col-1  col-3
a    1.0   10.0
b    2.0   15.0
c    3.0   24.0
d    4.0    NaN
e    NaN   10.0

In [123]:
a = df.pop('col-3')

In [124]:
a.__class__

pandas.core.series.Series

In [125]:
a

a    10.0
b    15.0
c    24.0
d     NaN
e    10.0
Name: col-3, dtype: float64

In [147]:
s1 = pd.Series(data=[1,2,3,4], index=['a','b','c','d'])
s2 = pd.Series(data=[10,20,30,40], index=['a','b','d','e'])
df = pd.DataFrame({'col-1': s1, 'col-2':s2})

In [129]:
df

   col-1  col-2
a    1.0   10.0
b    2.0   20.0
c    3.0    NaN
d    4.0   30.0
e    NaN   40.0

In [148]:
df.loc['f'] = [1,2]

In [145]:
df

   col-1  col-2
a    1.0   10.0
b    2.0   20.0
c    3.0    NaN
d    4.0   30.0
e    NaN   40.0
f    1.0    2.0

In [149]:
df.drop('e', axis=0)

   col-1  col-2
a    1.0   10.0
b    2.0   20.0
c    3.0    NaN
d    4.0   30.0
f    1.0    2.0

In [151]:
df.drop('e', axis=)

SyntaxError: invalid syntax (<ipython-input-151-adf5835559d6>, line 1)